<template>
    <div class="help">
        <div class="help__heading">Справка</div>
        <button class="help__close" v-on:click="$emit('helpVision')"><svg xmlns="http://www.w3.org/2000/svg" version="1" viewBox="0 0 24 24"><path d="M13 12l5-5-1-1-5 5-5-5-1 1 5 5-5 5 1 1 5-5 5 5 1-1z"></path></svg></button>
        <tabs>
            <tab title="Вход">
            <h3>Авторизация</h3>
            Для того чтобы получить доступ к приложению введите свои авторизационные данные в поля для авторизации и нажмите кнопку "Войти"<br>
            Если введенные данные корректны то вы попадете на страницу заказов, при неверные отобразится сообщение, что данные неверны.
            </tab>
            <tab title="Заказы">
            <h3>Добавление заказа</h3>
            Для добавления заказа необходимо нажать кнопку «Добавить»,
            которая расположена над списком заказов, после чего откроется окно
            для добавления заказа.<br>
            В окне добавления заказа необходимо запонить поля 
            <ins>даты заргузки</ins>, 
            <ins>даты доставки</ins>, 
            <ins>адрес загрузки</ins>, 
            <ins>контакт на загрузке</ins>, 
            <ins>адрес доставки</ins>, 
            <ins>ящик компании</ins>, 
            <ins>номер контейнера</ins>, 
            <ins>вес контейнера</ins>, 
            выбрать из выпадающих списков тип заказа, водителя, автомобиль, прицеп, клиента, декларанта, таможню и ппункт пропуска 
            ,нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр заказа</h3>
            Для редактирования и просмотра заказа необходимо выбрать заказ из списка заказов и нажать на него,
            после чего откроется окно просмотра и редактирования заказа.<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененного заказа необходимо нажать кнопку «Сохранить».
            <h3>Отображение заказа на карте</h3>
            Для отображения заказа на карте необходимо нажать кнопку «Отобрахить заказ на карте» в списке заказов.<br>
            Для закрытия окна с информацией о заказе необходимо нажать на кнопку закрытия в правом верхнем углу окна.
            <h3>Удаление заказа</h3>
            Для удаления заказа необходимо нажать на кнопку удаления заказа в списке заказов.
            <h3>Сортировка заказов</h3>
            Сортировка заказов производится по статусу и типу заказа. Для сортировки необходимо использовать <ins>поля сортировки</ins> над списком заказов.
            </tab>
            <tab title="Автомобили и прицепы">
            <h3>Добавление автомобиля/прицепа</h3>
            Для добавления автомобиля/прицепа необходимо нажать кнопку «Добавить»,
            которая расположена над списком автомобилей/прицепов, после чего откроется окно
            для добавления автомобиля/прицепа.<br>
            В окне добавления  автомобиля/прицепа необходимо запонить поля 
            <ins>брэнд</ins>, <ins>модель</ins>, <ins>номер</ins>, <ins>пробег</ins>, <ins>расход на 100 километров</ins>, <ins>дату последнего технического обслуживания</ins>, <ins>дату окончания белорусской страховки</ins>, <ins>дату окончания европейской страховки</ins> для автомобиля.<br>
            <ins>брэнд</ins>, <ins>модель</ins>, <ins>номер</ins>, <ins>дату последнего технического обслуживания</ins>, <ins>дату окончания белорусской страховки</ins>, <ins>дату окончания европейской страховки</ins> для прицепа.
            После заполнения всех полей, нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр автомобиля/прицепа</h3>
            Для редактирования и просмотра автомобиля/прицепа необходимо выбрать автомобиль/прицеп из списка автомобилей/прицепов и нажать на него,
            после чего откроется окно просмотра и редактирования автомобиля/прицепа.<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененного автомобиля/прицепа необходимо нажать кнопку «Сохранить».
            <h3>Удаление автомобиля/прицепа</h3>
            Для удаления автомобиля/прицепа необходимо нажать на кнопку удаления автомобиля/прицепа в списке автомобилей/прицепов.
            <h3>Поиск автомобилей/прицепов</h3>
            Поиск автомобилей/прицепов осуществляется по марке, модели и номеру. Для поиска необходимо использовать <ins>поле поиска</ins> над списком автомобилей/прицепов.
            </tab>
            <tab title="Клиенты">
            <h3>Добавление клиента</h3>
            Для добавления клиента необходимо нажать кнопку «Добавить»,
            которая расположена над списком клиентов, после чего откроется окно
            для добавления клиента.<br>
            В окне добавления клиента необходимо запонить поля <ins>наименования</ins> и <ins>информации</ins> о клиенте, нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр клиента</h3>
            Для редактирования и просмотра клиента необходимо выбрать клиента из списка клиентов и нажать на него,
            после чего откроется окно просмотра и редактирования клиента.<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененного клиента необходимо нажать кнопку «Сохранить».
            <h3>Удаление клиента</h3>
            Для удаления клиента необходимо нажать на кнопку удаления клиента в списке клиентов.
            <h3>Поиск таможень</h3>
            Поиск клиента осуществляется по названию. Для поиска необходимо использовать <ins>поле поиска</ins> над списком клиентов.
            </tab>
            <tab title="Пункты пропуска">
            <h3>Добавление пункта пропуска</h3>
            Для добавления пункта пропуска необходимо нажать кнопку «Добавить»,
            которая расположена над списком пунктов пропуска, после чего откроется окно
            для добавления пункта пропуска.<br>
            В окне добавления пункта пропуска необходимо запонить поле <ins>названия</ins>, нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр пункта пропуска</h3>
            Для редактирования и просмотра пункта пропуска необходимо выбрать пункт пропуска из списка пунктов пропуска и нажать на него,
            после чего откроется окно просмотра и редактирования пункта пропуска.<br>
            Поле <ins>локация</ins> недоступно для изменения, координаты вычисляются автоматически на этапе сохранения пункта пропуска<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененного пункта пропуска необходимо нажать кнопку «Сохранить».
            <h3>Удаление пункта пропуска</h3>
            Для удаления пункта пропуска необходимо нажать на кнопку удаления пункта пропуска в списке пунктов пропуска.
            <h3>Поиск пунктов пропуска</h3>
            Поиск пунктов пропуска осуществляется по названию. Для поиска необходимо использовать <ins>поле поиска</ins> над списком пунктов пропуска.
            </tab>
            <tab title="Таможни">
            <h3>Добавление таможни</h3>
            Для добавления таможни необходимо нажать кнопку «Добавить»,
            которая расположена над списком таможень, после чего откроется окно
            для добавления таможни.<br>
            В окне добавления таможни необходимо запонить поля <ins>названия</ins> и <ins>адреса</ins> таможни, нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр таможни</h3>
            Для редактирования и просмотра таможни необходимо выбрать таможню из списка таможень и нажать на нее,
            после чего откроется окно просмотра и редактирования таможни.<br>
            Поле <ins>локация</ins> недоступно для изменения, координаты вычисляются автоматически на этапе сохранения таможни<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененной таможни необходимо нажать кнопку «Сохранить».
            <h3>Удаление таможни</h3>
            Для удаления таможни необходимо нажать на кнопку удаления таможни в списке таможень.
            <h3>Поиск таможень</h3>
            Поиск таможень осуществляется по названию. Для поиска необходимо использовать <ins>поле поиска</ins> над списком таможень.
            </tab>
            <tab title="Декларанты">
            <h3>Добавление декларанта</h3>
            Для добавления декларанта необходимо нажать кнопку «Добавить»,
            которая расположена над списком декларантов, после чего откроется окно
            для добавления декларанта.<br>
            В окне добавления декларанта необходимо запонить поля <ins>наименования</ins> и <ins>информации</ins> о декларанте, нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр декларанта</h3>
            Для редактирования и просмотра декларанта необходимо выбрать декларанта из списка декларантов и нажать на него,
            после чего откроется окно просмотра и редактирования декларанта.<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененного декларанта необходимо нажать кнопку «Сохранить».
            <h3>Удаление декларанта</h3>
            Для удаления декларанта необходимо нажать на кнопку удаления декларанта в списке декларантов.
            <h3>Поиск декларантов</h3>
            Поиск декларантов осуществляется по наименованию. Для поиска необходимо использовать <ins>поле поиска</ins> над списком декларантов.
            </tab>
            <tab title="Пользователи">
            <h3>Добавление пользователя</h3>
            Для добавления пользователя необходимо нажать кнопку «Добавить»,
            которая расположена над списком пользователей, после чего откроется окно
            для добавления пользователя.<br>
            В окне добавления пользователя необходимо запонить поля <ins>имени</ins>, <ins>логина</ins> и <ins>пароля</ins>, 
            выбрать <ins>роль</ins> нового пользователя и нажать кнопку «Сохранить».
            <h3>Редактирование и просмотр пользователя</h3>
            Для редактирования и просмотра пользователя необходимо выбрать пользователя из списка пользователей и нажать на него,
            после чего откроется окно просмотра и редактирования пользователя.<br>
            Для того чтобы закрыть окно необходимо нажать на кнопку закрытия в правом верхнем углу формы.<br>
            Для сохранения измененного пользователя необходимо нажать кнопку «Сохранить».
            <h3>Удаление пользователя</h3>
            Для удаления пользователя необходимо нажать на кнопку удаления пользователя в списке пользователей.
            <h3>Поиск пользователей</h3>
            Поиск пользователей осуществляется по имени. Для поиска необходимо использовать <ins>поле поиска</ins> над списком пользователей.
            </tab>
            <tab title="О программе">
            <div class="center">              
            Данный проект разработан<br> 
            студентом 4-го курса группы 914302<br> 
            <ins>Тумащик Александрой</ins><br> 
            в качестве дипломного проекта<br> 
            Минск 2023 г.
            </div>
            </tab>
        </tabs>
    </div>
</template>

<script>
import { Tabs, Tab } from 'vue-slim-tabs'

export default {
  components: {
    Tabs, Tab
  }
}

</script>

<style lang="scss" scope>
h3{
  margin-bottom: 3px;
}
.center{
  padding: 150px 0;
  text-align: center;
  font-size: 25px;
}
.vue-tab{
  font-size: 12px;
}
.help {
  z-index: 4;
  position: absolute;
  height: 90vh;
  width: 90%;
  left: 50%;
  top: 50%;
  transform: translateX(-50%) translateY(-50%);
  padding: 1.5rem;
  border: 1px solid #EBEBFF;
  border-radius: 0.3rem;
  background-color: #fff;

  &__heading {
    margin: 0;
    font-size: 1.5rem;
    font-weight: 700;
    margin-bottom: 1.2rem;
  }
  &__close {
      position: absolute;
      opacity: .8;
      padding: 10px;
      right: 0;
      top: 0;
      cursor: pointer;
      background: transparent;
      border: 0;
      border-radius: 0;
      box-shadow: none;
      display: inline-block;
      height: 44px;
      vertical-align: top;
      visibility: inherit;
      width: 44px;
      
    &:hover {
      opacity: 1;
    }
  }

  .vue-tablist {
    border-bottom: 1px solid #42D9C8;
    flex-wrap: wrap;
  }
  .vue-tabpanel {
    padding-top: 1rem;
  }
  .vue-tab {
    margin-top: 1px;
    border-radius: 0.37rem 0.37rem 0 0;
    padding: 0.4rem 0.8rem;
    border: 1px solid transparent;
    border-bottom-color: #42D9C8;
    
    &[aria-selected="true"] {
      color: #42D9C8;
      border-color: #42D9C8;
      border-bottom-color: transparent;
      margin-bottom: -1px;
    }
  }
}
</style>
<style scope src="vue-slim-tabs/themes/default.css"></style>